/********************************************************************************
 * 1 Установите СУБД MySQL.                                                     *
 * 		Установил. Отчет в дз к первому уроку.                                  *
 *                                                                              *
 *   Создайте в домашней директории файл .my.cnf                                *
 *   задав в нем логин и пароль, который указывался при установке.              *
 *      Редактирую файл /etc/mysql/my.cnf                                       *
 * ******************************************************************************/

/***************************************
 * 2 a) Создайте базу данных example,  *
 *   b) разместите в ней таблицу users,* 
 *      состоящую из двух столбцов,    *
 *     числового id и строкового name. *
 * *************************************/

DROP DATABASE IF EXISTS example;
CREATE DATABASE example;

USE example;

DROP TABLE IF EXISTS users;
CREATE TABLE users(
	id INT UNSIGNED,
	name VARCHAR(255)
);

/***************************************************************
 * 3 Создайте дамп базы данных example из предыдущего задания, *
 *   разверните содержимое дампа в новую базу данных sample.   *
 * *************************************************************/

DROP DATABASE IF EXISTS sample;
CREATE DATABASE sample;

/***********************************************************
 * В терминале прописываем команды:                        *
 *  mysqldump example > example_dump.sql                   *
 *  mysql sample < example_dump.sql                        *
 ***********************************************************/

/********************************************************************************
 * (по желанию) Ознакомьтесь более подробно с документацией утилиты mysqldump.  *
 * Создайте дамп единственной ???единственной ли, или имеется ввиду, что        *
 * только для этой таблицы нужен дамп??? таблицы help_keyword базы данных mysql.*
 * Причем добейтесь того, чтобы дамп содержал только первые 100 строк таблицы.  *
 ********************************************************************************/

/************************************************************************************
 * mysqldump --opt --where='1 limit 100' mysql help_keyword > help_keyword_dump.sql *
 * только неполучилось развернуть этот дамп, ошибка, что таблица зарезервирована    *
 * базой mysql                                                                      *
 ************************************************************************************/





